package task3;

/**
 Подумать как описать логику взаимодействия человека и домашнего питомца. Сценарий: “Человек “зовёт”
 котика “кис-кис”, котик отзывается. Какое ещё взаимодействие может быть? Продумать какие проблемы могут
 возникнуть в том, коде, который они написали. Например в первой задаче (с генеалогическим древом) мы
 можем знать о двух людях, но не знаем в каких “отношениях” они были - двоюродные или троюродные, или
 мы точно знаем как звали прапрабабушку, но совершенно не знаем прабабушку - как хранить такие связи
 или что будет если в компоненту обхода передать ссылку на null-дерево. У задач нет единственного
 правильного решения
 */

public class MainPersonAnimals {
    public static void main(String[] args) {
        System.out.println("task3");

    }
}
